InformationRegisters/СтруктураБюджетаРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтруктураБюджетаРасходы</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтруктураБюджетаРасходы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает массив статей расходов, доступных по направлению деятельности по бюджету
//
// Параметры:
//    Организация - Справочник.Организации - Организация, по которой был сформирован бюджет
//    НаправлениеДеятельности - Справочник.НаправленияДеятельности - Направление деятельности, по которому получаем структуру
//    Период - Дата - Дата, на которую следует получить структуру
// Возвращаемое значение:
//    Массив - Массив со статьями расходов
//
Функция ДоступныеСтатьиПоНаправлениюДеятельности(Организация, НаправлениеДеятельности, Период) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Или Не ЗначениеЗаполнено(НаправлениеДеятельности) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаправлениеДеятельности", НаправлениеДеятельности);
	Запрос.УстановитьПараметр("Период",                  Период);
	Запрос.УстановитьПараметр("Организация",             Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 10
	|	СтруктураБюджетаРасходовСрезПоследних.СтатьяРасхода КАК СтатьяРасхода
	|ИЗ
	|	РегистрСведений.СтруктураБюджетаРасходы.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И НаправлениеДеятельности = &НаправлениеДеятельности
	|				И НЕ ЭтоГруппа) КАК СтруктураБюджетаРасходовСрезПоследних";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтатьяРасхода");
	
КонецФункции


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
